'''
把地址插入
database security.address
id address
'''
import random

import pymysql

#连接数据库
#默认host：localhost，port：3306可不写
db = pymysql.connect(host = "localhost",
                     port= 3306,
                     user = "root",
                     passwd = "123456",
                     database = "security",
                     charset = "utf8")

#生成游标对象，以执行sql语句，操作数据库数据，获取执行结果的对象
cur= db.cursor()

#地址编号列表
address_id_list=[]
for item in range(1,77113):
    id=random.choice(range(1,77113))
    address_id_list.append(id)


# 随机生成业主姓名列表names 共50000个,可能重复
lastname="赵钱孙李周吴郑王赵钱孙李周吴郑王赵钱孙李周吴郑王赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜费岑薛雷贺倪汤熊纪舒项祝董梁高夏蔡田樊胡凌霍"
middlename="伟勇军磊          涛斌强鹏杰峰超波辉刚健                    明亮俊飞凯浩华平鑫毅林洋宇敏宁建兵旭雷锋彬龙翔阳剑东博威海巍晨炜帅岩江松文云力成琦进昊宏欣坤冰锐震楠佳忠庆杨新骏君栋青帆 静荣立虎哲晖玮瑞光钢丹坚振晓祥良春晶星政智琪永迪冬琳胜康彪乐诚志维卫睿捷群森洪扬科奇铭航利鸣恒源聪凡颖欢昕武雄洁川清义滨皓达民跃越兴正靖曦璐挺淼泉程韬 冲硕远昆瑜晔煜红权征雨野慧萌山丰珂彤悦朋钧彦然枫嘉峥寅烨铮卓畅钊金可昱爽盛路晋谦克方闯耀奎一晟勤豪安尧全琛腾队鸿玉泽凌渊                  蕾广顺莹英峻攀宾驰燕霖喆椒国恺 潇琨轶芳吉亚梁焱侃臻嵩岳炯艳宝岗斐啸元辰萍柯羽培通天麟晗菲雪铁贺钰戈灿琼锦生原洲炎丽勋奕艺中德轩京标旺南黎禹莉蔚总益祺骥沛汉真非鹤升蒙城钦锴骁壮罡键瑶 虹石展翼为灏玲放娜露赞娟倩懿劲婷策魁霄冉敬卿均治迅臣桦镇骞河希瑾鹰舟丁涵弘纲泳理福俭乾纯双屹涌根怡果田岭昭飚勃嵘熙贤申琰宽鼎滔昌璞逸贵喜昂柳韶瑛伦茂景 柱岚实珏霞园学惠衡风玺赫桐寒圣陈旋礼霆月侠密堃富薇仁浪津垒齐炼瀚泓灵朝夏严意银璇鲲易行品垄靓苏澄赛思旗淳雯继友和革延能菁叶隽烽昶笑裕鲁铎昀骅高翀润熠锟 望卡微拓名秋冶雁开定想舒庚蓉牧重孟澎信郁珉钟盼恩周潮季烈魏奔承玎来桥尚增婧茜前琴麒竞童舜会柏冠佩游珊融满添咏响珩杉韧梅乔同梦树杭念遥苗胤榕耿崇湘里疆旻 启烁楷才仲隆媛晴章舰璟桔李影亭珺言笛弛营宪渝发逊运豹翊研登炳蕊鉴妍焰颂闻曙印玥夭冀阔圆湛澍争众肖祯默珍煌准普韦舸创芸彭泰心廷其业水焕炬韵干唯轲陆陶将骋 战朔耕操向葵潜凤兰仪沙胡璋秦珑朗举列蓓纬垚歌献或见多谊迎州声婕栩男洵颢照辛有育起淮坦量楚熹劫勉典诺溪显毓稳甫羿端旦焘辑宣宙岑存迁万煦渤沁甜日翰淦劼庭徽 豫也好颉雍怀北西耘秀肠玄令蓬联斯霁箭坡澜馨瀛港岱宗励琥谷异年尉习格桑丛淞领深赢宜律朴龚化陵庄财墨直煊欧棋孝子弢冕傲劭丞如燃弦墩溢崎容锁韩曼芬上连郑兆纪 盾相翌盈慰戟植晏任农恨桃 依秋 依波 香巧 紫萱 涵易 忆之 幻巧 美倩 安寒 白亦 惜玉 碧春 怜雪 听南 念蕾 紫夏 凌旋 芷梦 凌寒 梦竹 千凡 丹蓉 慧贞 思菱 平卉  笑柳 雪卉 南蓉 谷梦 巧兰 绿蝶 飞荷 佳蕊 芷荷 怀瑶 慕易 若芹 紫安 曼冬 寻巧 雅昕 尔槐 以旋 初夏 依丝 怜南 傲菡 谷蕊 笑槐 飞兰 笑卉 迎荷 佳音 梦君 妙绿  觅雪 寒安 沛凝 白容 乐蓉 映安 依云 映冬 凡雁 梦秋 梦凡 秋巧 若云 元容 怀蕾 灵寒 天薇 翠安 乐琴 宛南 怀蕊 白风 访波 亦凝 易绿 夜南 曼凡 亦巧 青易 冰真  白萱 友安 海之 小蕊 又琴 天风 若松 盼菡 秋荷 香彤 语梦 惜蕊 迎彤 沛白 雁彬 易蓉 雪晴 诗珊 春冬 晴钰 冰绿 半梅 笑容 沛凝 映秋 盼烟 晓凡 涵雁 问凝 冬萱 晓山 雁蓉 梦蕊 山菡 南莲 飞双 凝丝 思萱 怀梦 雨梅 冷霜 向松 迎丝 迎梅 雅彤 香薇 以山 碧萱 寒云 向南 书雁 怀薇 思菱 忆文 翠巧 书文 若山 向秋 凡白 绮烟 从蕾 天曼 又亦 从语 绮彤 之玉 凡梅 依琴 沛槐 又槐 元绿 安珊 夏之 易槐 宛亦 白翠 丹云 问寒 易文 傲易 青旋 思真 雨珍 幻丝 代梅 盼曼 妙之 半双 若翠 初兰 惜萍 初之 宛丝 寄南 小萍 静珊 千风 天蓉 雅青 寄文 涵菱 香波 青亦 元菱 翠彤 春海 惜珊 向薇 冬灵 惜芹 凌青 谷芹 雁桃 映雁 书兰 盼香 梅致 寄风 芳荷 绮晴 映之 醉波 幻莲 晓昕 傲柔 寄容 以珊 紫雪 芷容 书琴 美伊 涵阳 怀寒 易云 代秋 惜梦 宇涵 谷槐 怀莲 英莲 芷卉 向彤 新巧 语海 灵珊 凝丹 小蕾 迎夏 慕卉 飞珍 冰夏 亦竹 飞莲 秋月 元蝶 春蕾 怀绿 尔容 小玉 幼南 凡梦 碧菡 初晴 宛秋 傲旋 新之 凡儿 夏真 静枫 芝萱 恨蕊 乐双 念薇 靖雁 菊颂 丹蝶 元瑶 冰蝶 念波 迎翠 海瑶 乐萱 凌兰 曼岚 若枫 傲薇雅芝乐蕊秋灵凤娇觅云依伊山从寒忆香菱静曼青寒笑天涵蕾元柏代萱紫真千青雪珍寄琴绿蕊荷柳诗翠念瑶兰楠曼彤怀曼香巧采蓝芷天尔曼巧蕊"
firstname="伟勇军磊涛斌强鹏杰峰超波辉刚健明亮俊飞凯浩华平鑫毅林洋宇敏宁建兵旭雷锋彬龙翔阳剑东博威海巍晨炜帅岩江松文云力成琦进昊宏欣坤冰锐震楠佳忠庆杨新骏君栋青帆静荣立虎哲晖玮瑞光钢丹坚振晓祥良春晶星政智琪永迪冬琳胜康彪乐诚志维卫睿捷群森洪扬科奇铭航利鸣恒源聪凡颖欢昕武雄洁川清义滨皓达民跃越兴正靖曦璐挺淼泉程韬冲硕远昆瑜晔煜红权征雨野慧萌山丰珂彤悦朋钧彦然枫嘉峥寅烨铮卓畅钊金可昱爽盛路晋谦克方闯耀奎一晟勤豪安尧全琛腾队鸿玉泽凌渊蕾广顺莹英峻攀宾驰燕霖喆椒国恺潇琨轶芳吉亚梁焱侃臻嵩岳炯艳宝岗斐啸元辰萍柯羽培通天麟晗菲雪铁贺钰戈灿琼锦生原洲炎丽勋奕艺中德轩京标旺南黎禹莉蔚总益祺骥沛汉真非鹤升蒙城钦锴骁壮罡键瑶虹石展翼为灏玲放娜露赞娟倩懿劲婷策魁霄冉敬卿均治迅臣桦镇骞河希瑾鹰舟丁涵弘纲泳理福俭乾纯双屹涌根怡果田岭昭飚勃嵘熙贤申琰宽鼎滔昌璞逸贵喜昂柳韶瑛伦茂景柱岚实珏霞园学惠衡风玺赫桐寒圣陈旋礼霆月侠密堃富薇仁浪津垒齐炼瀚泓灵朝夏严意银璇鲲易行品垄靓苏澄赛思旗淳雯继友和革延能菁叶隽烽昶笑裕鲁铎昀骅高翀润熠锟望卡微拓名秋冶雁开定想舒庚蓉牧重孟澎信郁珉钟盼恩周潮季烈魏奔承玎来桥尚增婧茜前琴麒竞童舜会柏冠佩游珊融满添咏响珩杉韧梅乔同梦树杭念遥苗胤榕耿崇湘里疆旻启烁楷才仲隆媛晴章舰璟桔李影亭珺言笛弛营宪渝发逊运豹翊研登炳蕊鉴妍焰颂闻曙印玥夭冀阔圆湛澍争众肖祯默珍煌准普韦舸创芸彭泰心廷其业水焕炬韵干唯轲陆陶将骋战朔耕操向葵潜凤兰仪沙胡璋秦珑朗举列蓓纬垚歌献或见多谊迎州声婕栩男洵颢照辛有育起淮坦量楚熹劫勉典诺溪显毓稳甫羿端旦焘辑宣宙岑存迁万煦渤沁甜日翰淦劼庭徽豫也好颉雍怀北西耘秀肠玄令蓬联斯霁箭坡澜馨瀛港岱宗励琥谷异年尉习格桑丛淞领深赢宜律朴龚化陵庄财墨直煊欧棋孝子弢冕傲劭丞如燃弦墩溢崎容锁韩曼芬上连郑兆纪盾相翌盈慰戟植晏任农恨桃依秋依波香巧紫萱涵易忆之幻巧美倩安寒白亦惜玉碧春怜雪听南念蕾紫夏凌旋芷梦凌寒梦竹千凡丹蓉慧贞思菱平卉笑柳雪卉南蓉谷梦巧兰绿蝶飞荷佳蕊芷荷怀瑶慕易若芹紫安曼冬寻巧雅昕尔槐以旋初夏依丝怜南傲菡谷蕊笑槐飞兰笑卉迎荷佳音梦君妙绿觅雪寒安沛凝白容乐蓉映安依云映冬凡雁梦秋梦凡秋巧若云元容怀蕾灵寒天薇翠安乐琴宛南怀蕊白风访波亦凝易绿夜南曼凡亦巧青易冰真白萱友安海之小蕊又琴天风若松盼菡秋荷香彤语梦惜蕊迎彤沛白雁彬易蓉雪晴诗珊春冬晴钰冰绿半梅笑容沛凝映秋盼烟晓凡涵雁问凝冬萱晓山雁蓉梦蕊山菡南莲飞双凝丝思萱怀梦雨梅冷霜向松迎丝迎梅雅彤香薇以山碧萱寒云向南书雁怀薇思菱忆文翠巧书文若山向秋凡白绮烟从蕾天曼又亦从语绮彤之玉凡梅依琴沛槐又槐元绿安珊夏之易槐宛亦白翠丹云问寒易文傲易青旋思真雨珍幻丝代梅盼曼妙之半双若翠初兰惜萍初之宛丝寄南小萍静珊千风天蓉雅青寄文涵菱香波青亦元菱翠彤春海惜珊向薇冬灵惜芹凌青谷芹雁桃映雁书兰盼香梅致寄风芳荷绮晴映之醉波幻莲晓昕傲柔寄容以珊紫雪芷容书琴美伊涵阳怀寒易云代秋惜梦宇涵谷槐怀莲英莲芷卉向彤新巧语海灵珊凝丹小蕾迎夏慕卉飞珍冰夏亦竹飞莲秋月元蝶春蕾怀绿尔容小玉幼南凡梦碧菡初晴宛秋傲旋新之凡儿夏真静枫芝萱恨蕊乐双念薇靖雁菊颂丹蝶元瑶冰蝶念波迎翠海瑶乐萱凌兰曼岚若枫傲薇雅芝乐蕊秋灵凤娇觅云依伊山从寒忆香菱静曼青寒笑天涵蕾元柏代萱紫真千青雪珍寄琴绿蕊荷柳诗翠念瑶兰楠曼彤怀曼香巧采蓝芷天尔曼巧蕊"
names=[]
for ar in range(50000):
    name1 = random.choice(lastname)
    name2 = random.choice(middlename)
    name3 = random.choice(firstname)
    name=name1+name2+name3
    names.append(name)

#随机生成多于50000个电话数据至集合tels
head=[138,138,138,151,133,153,173,177,180,181,189,191,193,199,130,131,132,155,156,166,175,176,185,186,166,134,135,136,137,138,139,147,150,151,152,157,158,159,172,178,182,183,184,187,188,198]
tels={"183369289833",}
for ii in range(53000):
    tel=random.choice(head)*1000000000
    for i in range(9):
        n=random.randint(0,9)
        tel += n**(i+1)
    tels.add(tel)
tels=list(tels)

# 将一万条数据放到列表中,每个元素是一个元组e.g.("owners","张三","10086",77113)
info=[]
for n in range(50000):
    name=names[n]
    tel=str(tels[n])
    id=address_id_list[n]
    info.append(("owners",name,tel,id))

# 写操作
try:
    sql = "insert into owners (owners_visiters,name,tel,address_id) values(%s,%s,%s,%s);"
    cur.executemany(sql,info)#传参数，可以不用考虑格式(或者说已经至少字符串了?)
    db.commit()
except Exception as e:
    print(e)
    db.rollback()


cur.close()
db.close()

'''
secuirity.owners
+-----------------+--------------------------+------+-----+---------+----------------+
| Field           | Type                     | Null | Key | Default | Extra          |
+-----------------+--------------------------+------+-----+---------+----------------+
| id              | int(11)                  | NO   | PRI | NULL    | auto_increment |
| owners_visiters | set('owners','visiters') | NO   |     | NULL    |                |
| image_id        | varchar(80)              | YES  |     | NULL    |                |
| name            | char(16)                 | YES  |     | NULL    |                |
| tel             | char(32)                 | YES  |     | NULL    |                |
| address_id      | mediumint(9)             | YES  | MUL | NULL    |                |
+-----------------+--------------------------+------+-----+---------+----------------+

'''